Revit 2022 API
Document.NewFloor Method (CurveArray, FloorType, Level, Boolean, XYZ)
 Creates a floor within the project with the given horizontal profile and floor style on the specified level with the specified normal vector.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in the future version of Revit. To create new instance of Floor, call Floor.Create().")]
public Floor NewFloor(
	CurveArray profile,
	FloorType floorType,
	Level level,
	bool structural,
	XYZ normal
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in the future version of Revit. To create new instance of Floor, call Floor.Create().")> _
Public Function NewFloor ( _
	profile As CurveArray, _
	floorType As FloorType, _
	level As Level, _
	structural As Boolean, _
	normal As XYZ _
) As Floor
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in the future version of Revit. To create new instance of Floor, call Floor.Create().")]
public:
Floor^ NewFloor(
	CurveArray^ profile,
	FloorType^ floorType,
	Level^ level,
	bool structural,
	XYZ^ normal
)
Parameters
profile
Type: Autodesk.Revit.DB.CurveArray
 An array of planar lines and arcs that represent the horizontal profile of the floor.
floorType
Type: Autodesk.Revit.DB.FloorType
 A floor type to be used by the new floor instead of the default type.
level
Type: Autodesk.Revit.DB.Level
 The level on which the floor is to be placed.
structural
Type: System.Boolean
 If set, specifies that the floor is structural in nature.
normal
Type: Autodesk.Revit.DB.XYZ
 A vector that must be perpendicular to the profile which dictates which side of the floor is considered to be upper and down.
Return Value
 if successful, a new floor object within the project, otherwise null.
Remarks
 The curves of the profile must be contiguous and the Face formed by profile should be suitable to create floor.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the floor type does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the level does not exist in the given document.
See Also
Document Class
NewFloor Overload
Autodesk.Revit.Creation Namespace